src/toir_cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаОбеспечения</name>
    <type>
      <types>CatalogRef.СхемыОбеспечения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/CommonModules/торо_ТорговыеПредложенияКЭДОВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

// См. ТорговыеПредложения.НастройкиПубликации
//
Функция НастройкиПубликации(ТорговоеПредложение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиПубликации = ТорговыеПредложения.НастройкиПубликации(ТорговоеПредложение);
	
	Если НастройкиПубликации = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПоВсемТоварам = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговоеПредложение, "ПоВсемТоварам");
	НастройкиПубликации.Вставить("ПоВсемТоварам", ПоВсемТоварам);
	
	Возврат НастройкиПубликации;
	
КонецФункции

Функция СоздатьНоменклатуруПоДаннымКонтрагента(Знач НаборНоменклатурыКонтрагентов, Знач ЗначенияПоУмолчанию) Экспорт
	
	Результат = Новый Массив;
	СозданныеНоменклатуры = Новый Соответствие;
	
	Для Каждого НоменклатураКонтрагента Из НаборНоменклатурыКонтрагентов Цикл
		
		НайденнаяНоменклатура = СозданныеНоменклатуры.Получить(НоменклатураКонтрагента.ИдентификаторНоменклатуры);
		Если НайденнаяНоменклатура <> Неопределено Тогда
			НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы(НайденнаяНоменклатура);
		Иначе
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НоваяНоменклатура, ЗначенияПоУмолчанию);
			НоваяНоменклатура.Наименование       = НоменклатураКонтрагента.Наименование;
			НоваяНоменклатура.НаименованиеПолное = НоменклатураКонтрагента.Наименование;
			НоваяНоменклатура.Артикул            = НоменклатураКонтрагента.Артикул;
			Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(НоваяНоменклатура);
			Если ЗначениеЗаполнено(ЗначенияПоУмолчанию.СтавкаНДС) Тогда 
				НоваяНоменклатура.СтавкаНДС = УчетНДСВызовСервера.СтавкаНДСПоЗначениюПеречисления(ЗначенияПоУмолчанию.СтавкаНДС); 
			КонецЕсли;
			НоваяНоменклатура.ДополнительныеСвойства.Вставить("СменаВидаНоменклатурыОтработана");
			
			Если ЗначениеЗаполнено(ЗначенияПоУмолчанию.ЕдиницаИзмерения) Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = ЗначенияПоУмолчанию.ЕдиницаИзмерения;
			ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмеренияКод) Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоКоду(НоменклатураКонтрагента.ЕдиницаИзмеренияКод);
			ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(НоменклатураКонтрагента.ЕдиницаИзмерения, Истина);
			КонецЕсли;
			
			Если НЕ НоваяНоменклатура.ПроверитьЗаполнение() Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяНоменклатура.Записать();
			
			НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы(НоваяНоменклатура.Ссылка);
			
			СозданныеНоменклатуры.Вставить(НоменклатураКонтрагента.ИдентификаторНоменклатуры, НоменклатураИБ.Номенклатура);
			
		КонецЕсли;
		
		СозданныйЭлемент = Новый Структура;
		СозданныйЭлемент.Вставить("НоменклатураКонтрагента", НоменклатураКонтрагента);
		СозданныйЭлемент.Вставить("НоменклатураИБ", НоменклатураИБ);
		Результат.Добавить(СозданныйЭлемент);
		
	КонецЦикла;
	
	// Удалим сообщения, возникшие при проверке заполнения номенклатуры.
	// Остальные сообщения выводим как есть.
	НаборСообщений = ПолучитьСообщенияПользователю(Истина);
	Для Каждого Сообщение Из НаборСообщений Цикл
		Если Сообщение.КлючДанных <> Справочники.Номенклатура.ПустаяСсылка() Тогда
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Обработчик подписки на событие КонтрольНеразделенныхНаборовЗаписейПриЗаписи.
//
Процедура КонтрольНеразделенныхНаборовЗаписейПриЗаписиЭДОПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	// ОбменДанными.Загрузка не требуется.
	// Запись неразделенных данных из разделенного сеанса запрещена.
	КонтрольНеразделенныхДанныхПриЗаписи(Источник);
	
КонецПроцедуры

// Обработчик подписки на событие КонтрольНеразделенныхОбъектовПриЗаписи.
//
Процедура КонтрольНеразделенныхОбъектовПриЗаписиБЭДПриЗаписи(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется.
	// Запись неразделенных данных из разделенного сеанса запрещена.
	КонтрольНеразделенныхДанныхПриЗаписи(Источник);

КонецПроцедуры

// Вызывается при проверке доступности неразделенных данных для записи.
//
Процедура КонтрольНеразделенныхДанныхПриЗаписи(Знач Источник) 
	
	Если ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		ПредставлениеИсключения = НСтр("ru = 'Нарушение прав доступа.'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(
			ПредставлениеИсключения,
			УровеньЖурналаРегистрации.Ошибка,
			Источник.Метаданные());
		
		ВызватьИсключение ПредставлениеИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
